In [1]:
# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
#import scipy.stats as stats
import scipy.stats as stats
from scipy.stats import shapiro, poisson, chisquare, expon, kstest


# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [3]:
df = pd.read_csv("data/union_tablas.csv", index_col=0)
df.head(2)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN
1,100018,2017,2,2,2,4,1320,132.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN

# FASE 3
## Evaluación de Diferencias de Reservas de Vuelos por Nivel Educativo

In [21]:
#Preparación de Datos: Filtra el conjunto de datos para incluir únicamente las columnas relevantes: 'Flights Booked' y 'Education'.

df_filtrado = df[["Education", "Flights Booked"]]
df_filtrado.head()

  Education  Flights Booked
0  Bachelor               3
1  Bachelor               2
2  Bachelor              14
3  Bachelor               4
4  Bachelor               0

In [20]:
#Análisis Descriptivo: Agrupa los datos por nivel educativo y calcula estadísticas descriptivas básicas (como el promedio, la desviación estandar) 
#del número de vuelos reservados para cada grupo.

df_agrupado = df_filtrado.groupby("Education")["Flights Booked"].describe()
df_agrupado

                         count      mean       std  min  25%  50%  75%   max
Education
Bachelor              251400.0  4.129368  5.257359  0.0  0.0  1.0  8.0  39.0
College               101712.0  4.192209  5.287492  0.0  0.0  1.0  8.0  38.0
Doctor                 17616.0  4.202770  5.305066  0.0  0.0  1.0  8.0  32.0
High School or Below   18768.0  4.208919  5.296142  0.0  0.0  1.0  8.0  31.0
Master                 12192.0  4.233432  5.266140  0.0  0.0  1.0  8.0  33.0

In [18]:
#  Prueba Estadística: 
# Realiza una prueba de hipótesis para determinar si exoste una diferencia significativa en el número de vuelos reservados entre los diferentes niveles educativos.

                   count      mean       std  min  25%  50%  75%   max
Flights Booked  401688.0  4.155374  5.269271  0.0  0.0  1.0  8.0  39.0